/* ------------------------- 元组 ------------------------- */
/* ------------------------ 1.定义 ------------------------ */
// 数组合并了相同类型的对象，而元组（Tuple）合并了不同类型的对象。
const Arr: (number | string)[] = [123, "123"]; // 数组

const Trr: [number, string] = [123, "123"]; // 元组

/* ---------------------- 2.元组添加元素 ---------------------- */
// 元组添加元素，按定义的混合类型添加，没有类型的顺序
Trr.push("456");
Trr.push(456);
console.log(Trr); // [ 123, '123', '456', 456 ]
// 数组组添加元素，同元素一样
Arr.push("456");
Arr.push(456);
console.log(Arr); // [ 123, '123', '456', 456 ]
